# Rebar Bar Type Set Lap Length Method

Source: https://www.revitapidocs.com/2026/40db2d4a-622e-da37-cd5f-ffba541474b3.htm

---

| Rebar Bar Type Set Lap Length Method |
| --- |

Sets the lap length for the specified Rebar Splice Type.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetLapLength(
	ElementId rebarSpliceTypeId,
	double lapLength
)
```

```
Public Sub SetLapLength (
	rebarSpliceTypeId As ElementId,
	lapLength As Double
)
```

```
public:
void SetLapLength(
	ElementId^ rebarSpliceTypeId,
	double lapLength
)
```

```
member SetLapLength :
        rebarSpliceTypeId : ElementId *
        lapLength : float -> unit
```

#### Parameters

rebarSpliceTypeId ElementId
:   The Rebar Splice Type id.
 Interactions with Rebar Splice Types can be done with the functions in RebarSpliceTypeUtils .

lapLength Double
:   The new value of the lap length.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST\_RebarSpliceType category.  \-or\-  For the specified Rebar Splice Type the lap length is auto calculated and the lap length cannot be manually set.  Its value is computed based on the formula splice type: lap length multiplier \* bar nominal diameter. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | The given value for lapLength must be non\-negative. |

See Also

#### Reference

RebarBarType Class Autodesk.Revit.DB.Structure Namespace